In [1]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv('people.csv')
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba

In [5]:
df.columns

Index(['age', ' workclass', ' fnlwgt', ' education', ' education-num',
       ' marital-status', ' occupation', ' relationship', ' race', ' sex',
       ' capital-gain', ' capital-loss', ' hours-per-week', ' native-country'],
      dtype='object')

# 1. List out various countries. Do not duplicate country names

In [6]:
countries=df[' native-country'].drop_duplicates()
countries

0                      United-States
4                               Cuba
6                            Jamaica
11                             India
14                                 ?
15                            Mexico
27                             South
35                       Puerto-Rico
52                          Honduras
98                           England
112                           Canada
122                          Germany
135                             Iran
152                      Philippines
201                            Italy
217                           Poland
228                         Columbia
255                         Cambodia
265                         Thailand
289                          Ecuador
304                             Laos
311                           Taiwan
338                            Haiti
359                         Portugal
427               Dominican-Republic
497                      El-Salvador
503                           France
771                        Guatemala
873                            China
1020                           Japan
1025                      Yugoslavia
1430                            Peru
1565      Outlying-US(Guam-USVI-etc)
1586                        Scotland
1794                 Trinadad&Tobago
1888                          Greece
1948                       Nicaragua
2259                         Vietnam
2655                            Hong
2966                         Ireland
8562                         Hungary
19609             Holand-Netherlands
Name:  native-country, dtype: object

0            Adm-clerical
1         Exec-managerial
2       Handlers-cleaners
4          Prof-specialty
6           Other-service
13                  Sales
14           Craft-repair
15       Transport-moving
16        Farming-fishing
17      Machine-op-inspct
24           Tech-support
27                      ?
30        Protective-serv
442          Armed-Forces
536       Priv-house-serv
Name:  occupation, dtype: object

# 2. List out various education types. Do not duplicate education types

In [8]:
education=df[' education'].drop_duplicates()
education

0          Bachelors
2            HS-grad
3               11th
5            Masters
6                9th
10      Some-college
13        Assoc-acdm
14         Assoc-voc
15           7th-8th
20         Doctorate
52       Prof-school
56           5th-6th
77              10th
160          1st-4th
224        Preschool
415             12th
Name:  education, dtype: object

# 3. List out unique countries where the people live between the age of 31 to 35

In [10]:
Age=df.loc[(df['age']>=31)&(df['age']<=35),' native-country']
Age.drop_duplicates()

8              United-States
15                    Mexico
38                         ?
57               Puerto-Rico
152              Philippines
311                   Taiwan
480                 Portugal
593                   Canada
701                     Cuba
929                Guatemala
1092                   China
1135                 Jamaica
1794         Trinadad&Tobago
2022               Nicaragua
2208                   South
2233                 Germany
2288                   Haiti
2353                 England
2652                    Iran
2994                   Japan
3115                  Poland
3215                  Greece
3260                    Peru
4726             El-Salvador
5619                 Ireland
6559                   Italy
7287              Yugoslavia
7659                 Ecuador
7844                   India
7909                 Vietnam
7980                Cambodia
9388      Dominican-Republic
9743                  France
10630               Thailand
12985               Columbia
14214                   Hong
16957               Honduras
19609     Holand-Netherlands
28002                   Laos
Name:  native-country, dtype: object

# 4. Calculate the capital gain of people whose relationship is husbands

In [11]:
s=df.loc[df[' relationship']=='Husband',' capital-gain'].sum()
s

0

 # 5. How many people never married?

In [12]:
df[' relationship'].value_counts()

 Husband           13193
 Not-in-family      8305
 Own-child          5068
 Unmarried          3446
 Wife               1568
 Other-relative      981
Name:  relationship, dtype: int64

# 6. List out the different types of education with their percentage with overall data

In [13]:
df[' education'].value_counts(normalize=True) * 100

 HS-grad         32.250238
 Some-college    22.391818
 Bachelors       16.446055
 Masters          5.291607
 Assoc-voc        4.244341
 11th             3.608612
 Assoc-acdm       3.276926
 10th             2.865391
 7th-8th          1.983969
 Prof-school      1.768987
 9th              1.578576
 12th             1.329812
 Doctorate        1.268389
 5th-6th          1.022696
 1st-4th          0.515955
 Preschool        0.156629
Name:  education, dtype: float64

 # 7. Calculate the percentage of various countries in overall data

In [14]:
df[' native-country'].value_counts(normalize=True) * 100

 United-States                 89.585701
 Mexico                         1.974755
 ?                              1.790486
 Philippines                    0.608089
 Germany                        0.420749
 Canada                         0.371610
 Puerto-Rico                    0.350112
 El-Salvador                    0.325543
 India                          0.307116
 Cuba                           0.291760
 England                        0.276404
 Jamaica                        0.248764
 South                          0.245693
 China                          0.230337
 Italy                          0.224195
 Dominican-Republic             0.214981
 Vietnam                        0.205768
 Guatemala                      0.196554
 Japan                          0.190412
 Poland                         0.184270
 Columbia                       0.181198
 Taiwan                         0.156629
 Haiti                          0.135131
 Iran                           0.132060
 Portugal                       0.113633
 Nicaragua                      0.104419
 Peru                           0.095206
 France                         0.089064
 Greece                         0.089064
 Ecuador                        0.085992
 Ireland                        0.073708
 Hong                           0.061423
 Cambodia                       0.058352
 Trinadad&Tobago                0.058352
 Laos                           0.055281
 Thailand                       0.055281
 Yugoslavia                     0.049139
 Outlying-US(Guam-USVI-etc)     0.042996
 Honduras                       0.039925
 Hungary                        0.039925
 Scotland                       0.036854
 Holand-Netherlands             0.003071
Name:  native-country, dtype: float64

# 8. How many people doing tech support as an occupation?

In [15]:
df[' occupation'].value_counts()

 Prof-specialty       4140
 Craft-repair         4099
 Exec-managerial      4066
 Adm-clerical         3770
 Sales                3650
 Other-service        3295
 Machine-op-inspct    2002
 ?                    1843
 Transport-moving     1597
 Handlers-cleaners    1370
 Farming-fishing       994
 Tech-support          928
 Protective-serv       649
 Priv-house-serv       149
 Armed-Forces            9
Name:  occupation, dtype: int64

In [17]:
## tech-support 928

# 9. Considering the sum of data, which education is high capital gain?

In [19]:
df[' education'].value_counts()

 HS-grad         10501
 Some-college     7291
 Bachelors        5355
 Masters          1723
 Assoc-voc        1382
 11th             1175
 Assoc-acdm       1067
 10th              933
 7th-8th           646
 Prof-school       576
 9th               514
 12th              433
 Doctorate         413
 5th-6th           333
 1st-4th           168
 Preschool          51
Name:  education, dtype: int64

 # 10. What is the % of male and female data

In [20]:
df[' sex'].value_counts(normalize=True) * 100

 Male      66.920549
 Female    33.079451
Name:  sex, dtype: float64

## 11. Display the average capital gain in descending order for all the various occupation

In [12]:
df.groupby(' occupation')[' capital-gain'].mean()

 occupation
 ?                     604.491047
 Adm-clerical          495.954907
 Armed-Forces            0.000000
 Craft-repair          649.512808
 Exec-managerial      2262.772996
 Farming-fishing       589.726358
 Handlers-cleaners     257.572993
 Machine-op-inspct     328.689311
 Other-service         191.301669
 Priv-house-serv       279.852349
 Prof-specialty       2726.699517
 Protective-serv       708.098613
 Sales                1319.829315
 Tech-support          673.552802
 Transport-moving      490.323732
Name:  capital-gain, dtype: float64

# 12. What is the average salary of unmarried people?

In [39]:
f=df[' capital-gain'].mean()
f

1077.6488437087312

In [44]:
df

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States

In [47]:
g=df.loc[df[' marital-status']=='Never-married',' capital-gain']
g.mean()

nan

 # 13. How many people working in local government?

In [25]:
df[' workclass'].value_counts()

 Private             22696
 Self-emp-not-inc     2541
 Local-gov            2093
 ?                    1836
 State-gov            1298
 Self-emp-inc         1116
 Federal-gov           960
 Without-pay            14
 Never-worked            7
Name:  workclass, dtype: int64

# 14. Create a data set having only the rows containing Divorced people

In [56]:
result=df[df[' marital-status']=='Divorced']
result

Empty DataFrame
Columns: [age,  workclass,  fnlwgt,  education,  education-num,  marital-status,  occupation,  relationship,  race,  sex,  capital-gain,  capital-loss,  hours-per-week,  native-country]
Index: []

In [13]:
df.loc[df[' marital-status'] == 'Divorced']

Empty DataFrame
Columns: [age,  workclass,  fnlwgt,  education,  education-num,  marital-status,  occupation,  relationship,  race,  sex,  capital-gain,  capital-loss,  hours-per-week,  native-country]
Index: []

# 15. What is the sum of capital gains of Never married and divorced people?

In [10]:
md=df.loc[(df[' marital-status']=='Never-married')&(df[' marital-status']=='Divorced'),' capital-gain']
md.sum()

0

# 16. How many people didn’t go to college?

In [27]:
educationcount=df[' education'].value_counts()
educationcount

 HS-grad         10501
 Some-college     7291
 Bachelors        5355
 Masters          1723
 Assoc-voc        1382
 11th             1175
 Assoc-acdm       1067
 10th              933
 7th-8th           646
 Prof-school       576
 9th               514
 12th              433
 Doctorate         413
 5th-6th           333
 1st-4th           168
 Preschool          51
Name:  education, dtype: int64

# 17. How many people work 40 hours per week?

In [28]:
df[' hours-per-week'].value_counts()

40    15217
50     2819
45     1824
60     1475
35     1297
      ...
82        1
92        1
87        1
74        1
94        1
Name:  hours-per-week, Length: 94, dtype: int64

# 18. Describe the data set

In [29]:
df.describe(percentiles=None, include=None, exclude=None, datetime_is_numeric=False)

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

# 19. Display the percentage of race in descending order

In [27]:
race=df[' race'].value_counts(normalize=True) * 100
race

 White                 85.427352
 Black                  9.594300
 Asian-Pac-Islander     3.190934
 Amer-Indian-Eskimo     0.955130
 Other                  0.832284
Name:  race, dtype: float64

# 20. How many private-sector employees never married?

In [32]:
a=df.loc[(df[' marital-status']=='Never-married'),' workclass']
a.sum()

0

# 21.Consider 0 as a null value, drop null values, and find the how many rows in the data set

In [38]:
f1=df.replace([0], np.NaN)
f1.sum()

age                                                           1256257.0
 workclass             State-gov Self-emp-not-inc Private Private Pr...
 fnlwgt                                                    6179373392.0
 education             Bachelors Bachelors HS-grad 11th Bachelors Ma...
 education-num                                                 328237.0
 marital-status        Never-married Married-civ-spouse Divorced Mar...
 occupation            Adm-clerical Exec-managerial Handlers-cleaner...
 relationship          Not-in-family Husband Not-in-family Husband W...
 race                  White White White Black Black White Black Whi...
 sex                   Male Male Male Male Female Female Female Male...
 capital-gain                                                35089324.0
 capital-loss                                                 2842700.0
 hours-per-week                                               1316684.0
 native-country        United-States United-States United-States Uni...
85.42735173981143                                             2781600.0
9.59429992936335                                               312400.0
3.190933939375326                                              103900.0
0.9551303706888609                                              31100.0
0.8322840207610331                                              27100.0
dtype: object

# 22. Calculate the sum of capital gain for India and United-States

In [36]:
t=df.loc[(df[' native-country']=='India')& (df[' native-country']=='United-States') ,' capital-gain']
t

Series([], Name:  capital-gain, dtype: int64)

In [51]:
f=df[' capital-gain'].groupby(df[' native-country']=='India').sum()
f

 native-country
False    35089324
Name:  capital-gain, dtype: int64

# 23. Replace all 0 values into 100 without using replace function

In [60]:
f2=df.replace([0],100)
f2

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,100,40,United-States
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,100,100,13,United-States
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,100,100,40,United-States
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,100,100,40,United-States
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,100,100,40,Cuba
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,100,100,38,United-States
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,100,100,40,United-States
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,100,100,40,United-States
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,100,100,20,United-States
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,100,40,United-States

 # 24. What is the % of the relationship between education-num and capital gain

# 25. Do under-sampling of data to 10,000 rows without replacement

In [10]:
df.sample(n=10000)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country
4810,40,Private,179717,Bachelors,13,Divorced,Sales,Not-in-family,White,Male,0,1564,60,United-States
5954,29,Private,201454,Some-college,10,Never-married,Adm-clerical,Not-in-family,White,Female,0,0,40,United-States
12616,49,Private,232586,5th-6th,3,Married-civ-spouse,Craft-repair,Husband,White,Male,0,0,40,United-States
12325,45,Private,187226,Assoc-acdm,12,Married-civ-spouse,Handlers-cleaners,Husband,White,Male,0,0,40,United-States
23256,63,Private,383058,Bachelors,13,Married-civ-spouse,Sales,Husband,White,Male,0,1848,40,United-States
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
20649,29,Private,53434,Assoc-voc,11,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,60,United-States
21627,30,Private,251120,Assoc-acdm,12,Never-married,Sales,Not-in-family,White,Male,0,0,40,England
11843,26,Private,283715,HS-grad,9,Never-married,Craft-repair,Own-child,White,Male,0,0,40,United-States
23090,46,Federal-gov,268281,Assoc-acdm,12,Divorced,Adm-clerical,Unmarried,White,Female,0,0,40,United-States
23985,22,Private,118310,Assoc-acdm,12,Never-married,Prof-specialty,Own-child,White,Female,0,0,16,United-States

# 26. What is the most frequent country?

In [64]:
df[' native-country' ].value_counts()

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 France                           29
 Greece                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Cambodia                         19
 Trinadad&Tobago                  19
 Laos                             18
 Thailand                         18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Honduras                         13
 Hungary                          13
 Scotland                         12
 Holand-Netherlands                1
Name:  native-country, dtype: int64

In [65]:
## Most frequent country is United-States 29170

 # 27. What is the sum of capital gain where the divorced people who didn’t go to college for higher degrees?

# 29. Consider the ? (question marks) are null values, drop those rows and display
the % of data based on marital-status

# 30. Based on the given data which occupation do you prefer for your career and why?

In [9]:
ocupation=df[' occupation'].drop_duplicates()
ocupation

0            Adm-clerical
1         Exec-managerial
2       Handlers-cleaners
4          Prof-specialty
6           Other-service
13                  Sales
14           Craft-repair
15       Transport-moving
16        Farming-fishing
17      Machine-op-inspct
24           Tech-support
27                      ?
30        Protective-serv
442          Armed-Forces
536       Priv-house-serv
Name:  occupation, dtype: object

In [ ]:
#### I can prefer Exec-managerial because then only I can have the power of defines the vision and goals of  organization,
### Executive managers also oversee personnel decisions, such as hiring and firing, and. also compensation.